import sqlite3

conn =sqlite3.connect("DBGallery.db")  

conn.execute(''' INSERT INTO EXHIBITION VALUES(120,'Η Αστική τάξη και οι ζωγράφοι της(1862-1900)',800000,'2010-4-19',NULL,FALSE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(300,'Γύρω στο 1900',300000,'2010-4-19',NULL,FALSE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(400,'Ευρωπαϊκή Ζωγραφική',1100000,'2011-2-8',NULL,FALSE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(500,'Σύγχρονη Ελληνική Χαρακτική',500000,'2011-5-20',NULL,FALSE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(6784,'Επτανησιακή Σχολή',1000000,'2021-12-1','2022-3-28',TRUE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(6783,'Η Ζωγραφική του Ελεύθερου Ελληνικού Κράτους τα χρόνια της βασιλείας του Όθωνα(1832-1862)',500000,'2021-9-1','2022-2-28',TRUE);''') 
conn.execute(''' INSERT INTO EXHIBITION VALUES(6782,'Ελληνική Χαρακτική Μεσοπολέμου. Δάσκαλοι, Μαθητές, Επίγονοι',600000,'2014-6-3','2015-3-1',TRUE);''')
conn.execute(''' INSERT INTO EXHIBITION VALUES(6781,'Μοντερνισμός και Παράδοση',700000,'2011-10-20','2012-1-8',TRUE);''') 

conn.execute(''' INSERT INTO HALL VALUES(1,3000,0,'West',700,120);''') 
conn.execute(''' INSERT INTO HALL VALUES(2,6250,0,'West',1500,120);''') 
conn.execute(''' INSERT INTO HALL VALUES(3,3250,0,'West',750,300);''') 
conn.execute(''' INSERT INTO HALL VALUES(4,8400,0,'East',2000,400);''') 
conn.execute(''' INSERT INTO HALL VALUES(5,4100,0,'East',1000,500);''') 
conn.execute(''' INSERT INTO HALL VALUES(6,4000,1,'North',950,6784);''') 
conn.execute(''' INSERT INTO HALL VALUES(7,4000,1,'North',900,6784);''') 
conn.execute(''' INSERT INTO HALL VALUES(8,8000,1,'South',1900,6784);''') 


conn.execute(''' INSERT INTO ARTIST VALUES(1201,'Ο Συμεών Σαββίδης (Τοκάτη Μικράς Ασίας, 1859 – Αθήνα, 1927) ήταν Έλληνας ζωγράφος, από τους κυριότερους εκπροσώπους της λεγόμενης «Σχολής του Μονάχου».','Male',1927,1859,'Τοκάτη','Συμαιών',NULL,'Σαββίδης','Sabbides');   ''') 
conn.execute(''' INSERT INTO ARTIST VALUES(1202,'Ο Νικηφόρος Λύτρας (Πύργος Τήνου, 1832 – Αθήνα, 13 Ιουνίου 1904) ήταν ένας από τους μεγαλύτερους Έλληνες ζωγράφους και δασκάλους της ζωγραφικής κατά τον 19ο αιώνα. Θεωρείται από τους σημαντικότερους εκπροσώπους της Σχολής του Μονάχου και πρωτοπόρος στην διαμόρφωση της διδασκαλίας των Καλών Τεχνών στην Ελλάδα.','Male',1904,1832,'Τήνο','Νικηφόρος',NULL,'Λύρας',NULL);   ''')
conn.execute(''' INSERT INTO ARTIST VALUES(1203,'Ο Νικόλαος Γύζης (Σκλαβοχώρι Τήνου, 1 Μαρτίου 1842 – Μόναχο, 22 Δεκεμβρίου 1900/ 4 Ιανουαρίου 1901 ) ήταν ένας από τους πιο σημαντικούς Έλληνες ζωγράφους του 19ου αιώνα της λεγόμενης «Σχολής του Μονάχου». Διακρίθηκε σε όλα τα χρόνια των σπουδών του και πήρε τα πρώτα βραβεία στην ξυλογραφία, τη ζωγραφική και τη χαλκογραφία.','Male',1901,1842,'Τήνο','Νικόλαος',NULL,'Γύζης',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(1204,'Ο Κωνσταντίνος Βολανάκης ή Βολονάκης (Ηράκλειο Κρήτης, 17 Μαρτίου 1837 - Πειραιάς, 29 Ιουνίου 1907) ήταν ένας από τους σημαντικότερους Έλληνες ζωγράφους του 19ου αιώνα. Θεωρείται ο «πατέρας της ελληνικής θαλασσογραφίας».','Male',1907,1837,'Ηράκλειο','Κωνσταντίνος',NULL,'Βολονάκης',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(3001,'Η Σοφία Λασκαρίδου (Φεβρουάριος του 1876 στην Αθήνα - 13 Νοεμβρίου 1965 Καλλιθέα Αττικής) ήταν Ελληνίδα ζωγράφος.','Female',1965,1882,'Αθήνα','Σοφία',NULL,'Λασκαρίδου',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(3002,'Ο Ιάκωβος Ρίζος (Αθήνα 1849 – Παρίσι 1926) ήταν Έλληνας ζωγράφος που έζησε το μεγαλύτερο διάστημα της ζωής του στη Γαλλία.','Male',1926,1849,'Αθήνα','Ιάκωβος',NULL,'Ρίζος','Jacques Rizo');   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(4001,'Ο Πάμπλο Ρουίθ ι Πικάσο, περισσότερο γνωστός ως Πάμπλο Πικάσο, (25 Οκτωβρίου 1881 - 8 Απριλίου 1973) ήταν Ισπανός ζωγράφος, χαράκτης, γλύπτης, ποιητής, σκηνογράφος και δραματουργός.','Male',1973,1881,'Μάλαγα','Πάμπλο','Ρούθ','Πικάσο',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(4002,'Ο Πητ (Πίιτ) Μοντριάν (Piet Mondrian, πραγματικό όνομα Pieter Cornelis Mondriaan, 7 Μαρτίου 1872 – 1 Φεβρουαρίου 1944) ήταν Ολλανδός ζωγράφος, ένας από τους σημαντικότερους εκπροσώπους της μοντέρνας τέχνης και συνιδρυτής του κινήματος του νεοπλαστικισμού','Male',1944,1872,'Άμερσφοορτ','Πίτερ','Κορνέλης','Μοντριάν','Piet Mondrian');   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(4003,'Ο Λούκα Τζορντάνο (Luca Giordano, 1634 – 1705) ήταν Ιταλός ζωγράφος του ύστερου Μπαρόκ.','Male',1705,1634,'Νάπολη','Λούκα',NULL,'Τζορντάνο',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(4004,'Ο Ζαν Αντρέ Ριξέν (Jean Andre Rixens, Σεν Γκωντέν 1846 – Παρίσι 1924) ξεκίνησε τις σπουδές του στη Σχολή Καλών Τεχνών της Τουλούζ και από το 1846 συνέχισε στο Παρίσι, όπου, μεταξύ των άλλων, υπήρξε μαθητής του Ζερόμ (Gerome).','Male',1705,1634,'Σεν-Γκωντέν','Αντρέ','Ζαν','Ριξέν',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(5001,'Ξεκίνησε τις σπουδές του από το εργαστήριο του Γιάννη Μόραλη στην Ανωτάτη Σχολή Καλών Τεχνών Αθήνας (1972-1974) και συνέχισε στη Γερμανία, στη Staatlische Hochschule für bildende Künste του Braunschweig, όπου σπούδασε χαρακτική, γραφικές τέχνες και κινηματογράφο κινουμένων σχεδίων (1975-1980).','Male',NULL,1954,'Αθήνα','Μιχάλης',NULL,'Αρφαράς',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(5002,'Σπούδασε με υποτροφία στην ΑΣΚΤ της Αθήνας (1956-1962), ζωγραφική με τον Γ. Μόραλη και χαρακτική με τους Γ. Κεφαλληνό και Κ. Γραμματόπουλο. Αποφοίτησε με πέντε επαίνους.','Male',2021,1935,'Αθήνα','Γιώργος',NULL,'Μήλιος',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(5003,'Σπούδασε Χαρακτική στην Α.Σ.Κ.Τ. με δάσκαλο  τον Κ. Γραμματόπουλο και Σκηνογραφία με τον Β. Βασιλειάδη. Αποφοίτησε από την Α.Σ.Κ.Τ. με έπαινο  «φιλοτεχνηθέντων έργων »το 1978.','Male',NULL,1954,'Θεσσαλονίκη','Ξενωφών',NULL,'Σαχίνης','Ξενής Σαχίνης');   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(5004,'Σπούδασε ζωγραφική στη Σχολή Καλών Τεχνών του Παρισιού (1956-1962). Μετά την ολοκλήρωση των σπουδών του παρέμεινε στη γαλλική πρωτεύουσα και από το 1976 ως το 1988 δίδαξε λιθογραφία στην ίδια σχολή. Το 1988 επέστρεψε στην Ελλάδα, όπου ζει και εργάζεται μέχρι σήμερα.','Male',NULL,1938,'Αθήνα','Βασίλης',NULL,'Σπεράντζας',NULL);   ''')  

conn.execute(''' INSERT INTO ARTIST VALUES(6781,'Ο Κωνσταντίνος Παρθένης (Αλεξάνδρεια Αιγύπτου, 10 Μαΐου 1878 - Αθήνα, 25 Ιουλίου 1967) ήταν διακεκριμένος Έλληνας ζωγράφος, που με το έργο του έφερε σημαντική αλλαγή στα εικαστικά δρώμενα της Ελλάδας στις αρχές του 20ού αιώνα.','Male',1967,1878,'Αλεξάνδρεια','Κωνσταντίνος',NULL,'Παρθένης',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(6782,'','Male',NULL,1938,'Αθήνα','Βασίλης',NULL,'Σπεράντζας',NULL);   ''')  
conn.execute(''' INSERT INTO ARTIST VALUES(6783,'','Male',NULL,1938,'Αθήνα','Βασίλης',NULL,'Σπεράντζας',NULL);   ''')  



conn.execute(''' INSERT INTO ARTWORK VALUES(12011,'Στον Κινέζικο Πύργο του Μοναχού','Λάδι σε ξύλο','33x24','Πίνακας',NULL,NULL,'Ιμπρεσιονισμός',120,1,1201);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12012,'Το άναμμα του τσιμπουκιού','Λάδι σε μουσαμά','83x56','Πίνακας',1899,'Περιγράφει με αυθεντικό τρόπο το άναμμα του τσιμπουκιού, σαν μια τελετουργία.', 'Ιμπρεσιονισμός',120,1,1201);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12013,'Σπουδή για το χρώμα','Λάδι σε ξύλο','60,9x50,9','Πίνακας',1910,NULL,'Ιμπρεσιονισμός',120,1,1201);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(12021,'Το φίλημα','Λάδι σε μουσαμά','79x69','Πίνακας',1878,'Στο “Φίλημα” η σκηνή ξετυλίγεται σε μια εσωτερική αυλή, όπου βλέπουμε ένα λυγερόκορμο κορίτσι να τεντώνεται για να φτάσει να φιλήσει το αγαπημένο της αγόρι, που προβάλλει το κεφάλι του από το ψηλό παράθυρο.','Συμβολισμός',120,1,1202);   ''')
conn.execute(''' INSERT INTO ARTWORK VALUES(12022,'Παιδί που καπνίζει','Λάδι σε ξύλο','23x18','Πίνακας',1894,NULL,'Συμβολισμός',120,1,1202);   ''')
conn.execute(''' INSERT INTO ARTWORK VALUES(12023,'Άνθη επιταφίου','Λάδι σε μουσαμά','80x51','Πίνακας',1901,NULL,'Συμβολισμός',120,1,1202);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(12031,'Κούκου','Λάδι σε μουσαμά','100x75','Πίνακας',1882,NULL,'Ρεαλισμός',120,2,1203);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12032,'Η χαρτομάντισσα','Λάδι σε μουσαμά','72,5x92,5','Πίνακας',1885,NULL,'Ρεαλισμός',120,2,1203);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12033,'Παιδικοί αρραβώνες','Λάδι σε μουσαμά','103x155','Πίνακας',1877,'Τα “Αρραβωνιάσματα των παιδιών” είναι ένα έργο που ζωγραφίστηκε σε δύο παραλλαγές και απέσπασε πολλές διακρίσεις, απεικονίζει δε ένα έθιμο από τον καιρό της Τουρκοκρατίας.','Ρεαλισμός',120,2,1203);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(12041,'Πανηγύρι στο Μόναχο','Λάδι σε μουσαμά','60x130','Πίνακας',1876,' Έχουμε μια σκηνή τσίρκου, από αυτές που οργανώνονταν και οργανώνονται ακόμη και σήμερα στο Μόναχο τον Οκτώβριο (στο Oktoberfest).','Ιμπρεσιονισμός',120,2,1204);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12042,'Μαζεύοντας τα δίχτυα','Λάδι σε μουσαμά','69x135','Πίνακας',1871,'Ζωγραφίστηκε στο Μόναχο και παρουσιάζει το μάζεμα των διχτυών από τους ψαράδες την ώρα της ανατολής.','Ιμπρεσιονισμός',120,2,1204);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12043,'Στην αποβάθρα','Λάδι σε μουσαμά','70x45','Πίνακας',1870,NULL,'Ρεαλισμός',120,2,1204);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(12044,'Αραγμένα καράβια','Λάδι σε μουσαμά','112x212','Πίνακας',1889,NULL,'Ρεαλισμός',120,2,1204);   ''') 


conn.execute(''' INSERT INTO ARTWORK VALUES(30011,'Εμπρός στο τζάκι','Λάδι σε μουσαμά','100x81','Πίνακας',1910,NULL,'Ρομαντισμός',300,3,3001);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(30012,'La belle epoque','Λάδι σε χαρτόνι','66x51','Πίνακας',1912,NULL,'Ρομαντισμός',300,3,3001);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(30021,'Στην ταράτσα','Λάδι σε μουσαμά','111x167','Πίνακας',1897,'Ο πίνακας εκφράζει το κλίμα ευφορίας, το ευ ζην των πλούσιων αστών της Αθήνας στο τέλος του αιώνα.','Ιμπρεσιονισμός',300,3,3002);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(30022,'Κυρία ξαπλωμένη στον καναπέ','Λάδι σε μουσαμά','43x60','Πίνακας',1887,NULL,'Ιμπρεσιονισμός',300,3,3002);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(30023,'Κυρία στον κήπο με το σκύλο της','Λάδι σε μουσαμά','39x30','Πίνακας',1889,NULL,'Ιμπρεσιονισμός',300,3,3002);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(40011,'Γυναικείο κεφάλι','Λάδι σε μουσαμά','56x40','Πίνακας',1939,'Πρόκειται για πορτραίτο της φωτογράφου Ντόρα Μάαρ (Dora Maar, 1907 – 1997), συντρόφου του Πικάσσο κατά την περίοδο 1936-1943','Κυβισμός',400,4,4001);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(40021,'Τοπίο','Λάδι σε χαρτί κολλημένο σε ξύλο','24x33','Πίνακας',1905,NULL,'Νατουραλισμός',400,4,4002);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(40022,'Μύλος','Λάδι σε χαρτί κολλημένο ξύλο','35x44','Πίνακας',1905,NULL,'Νατουραλισμός',400,4,4002);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(40031,'Εσθήρ και Ασσουήρος','Λάδι σε μουασαμά','186x172','Πίνακας',1665,NULL,'Μπαρόκ',400,4,4003);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(40032,'Η θεραπεία του παραλυτικού','Λάδι σε ξύλο','96x87','Πίνακας',1653,'Στο έργο απεικονίζεται η σκηνή, που περιγράφεται στο Ευαγγέλιο του Ιωάννη, της θεραπείας του παραλυτικού στην κολυμπήθρα της Βησθαβέε.','Μπαρόκ',400,4,4003);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(40041,'Ημέρα εγκαινίων στο Palais des Champs Elysees','Λάδι σε μουσαμά','110x170','Πίνακας',1890,'Ο πίνακας της Συλλογής Ευριπίδη Κουτλίδη απεικονίζει την ημέρα των εγκαινίων στο Μέγαρο των Ηλυσίων Πεδίων ή Μέγαρο της Βιομηχανίας,','Ρεαλισμός',400,4,4004);   ''') 

conn.execute(''' INSERT INTO ARTWORK VALUES(50011,'Έντομο','Δίχρωμη λιθογραφία σε χαρτί','70x50','Χαρακτική',2004,NULL,'Αφηρημένο',500,5,5001);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(50021,'Χωρίς τίτλο','Οξυγραφία σε χαρτί','30,2x24,6','Χαρακτική',1999,NULL,'Αφηρημένο',500,5,5002);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(50022,'Χωρίς τίτλο','Οξυγραφία σε χαρτί','32,1x34,7','Χαρακτική',1999,NULL,'Αφηρημένο',500,5,5002);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(50031,'Ο Ξενής με τη σύζυγό του Louis Corinth','Λινόλεουμ, χαρτί και πλεξιγκλάς','100x100x5','Χαρακτική',2011,NULL,'Αφηρημένο',500,5,5003);   ''') 
conn.execute(''' INSERT INTO ARTWORK VALUES(50041,'Μπλε εσωτερικό','Έγχρωμη λιθογραφία','40x49,5','Χαρακτική',1975,NULL,'Εξπρεσιονισμός',500,5,5004);   ''') 



conn.commit()
conn.close()